package day0302;

// 변수(Variable)
//  - 내부의 값이 변할 수 있는 공간을 변수라 부름.
//  - 변수의, 경우 우리가 메무리 주소의 값을 직접 부르는 것이 아니라
//    해당 공간에 우리가 이름을 짓고
//    그 이름을 호출하게 되는 형식이 된다.
//  - 변수를 사용하기 위해서는 우리가 선언과 초기화 라는 단계를 거쳐야 한다.

// 변수의 선언(Declaration)
//  - 우리가 변수를 사용하기 위해서는 해당 변수가 어떤 종류의 값을 가질 수 있고
//    해당 공간을 뭐라고 부를지 반드시 "선언" 해 주어야 한다.
//  - 변수를 선언 할 때에는 다음과 같은 코드의 형태를 가진다.
//          데이터타입 변수이름;
// 데이터 타입  : 해당 변수가 저장 가능한 값의 종류
// 변수 이름   : 소문자로 시작하고 낙타등 표기법을 사용하는 명사

// 변수의 초기화(Initialization)
//  - 변수를 선언하고 나서 우리가 해당 변수를 사용하기 위해서는 반드시 초기값을 넣어주어야 한다.
//  - 값을 넣어주게 되면 해당 공간이 저장 가능할 종류의 값인 경우엔 그 값을 저장하게 된다.
//  - 또한, 우리가 변수의 초기화는 여러번 해줄 수도 있는데 해줄 때 마다 
//    기존에 저장되어 있던 값은 무조건 사라지게 된다. 즉 새로운 값으로 덮어쓰게 되는 것이다.
//  - 또한, 초기화는 우리가 할당(Allocation) 이라고도 한다.
//  - 초기화는 다음과 같은 코드 형태를 가진다.
//          변수 이름 = 값;

// 변수의 선언과 초기화는 각각 두줄의 코드로도 해줄 수 있지만,
// 한줄로도 적어줄 수 있다.
// 이때는 다음과 같은 형태를 가진다.
//           데이터타입 변수이름 = 값;

public class Ex03Variable {

}
